{"src/clean-remote":["Servidor do VS Code encerrado no {0}.","Falha ao encerrar o Servidor do VS Code em {0}.","Abrir registros"],"src/command-interactors":["O encaminhamento de porta está desabilitado","Falha no download do servidor do lado do cliente","Falha no download do servidor do lado do cliente","Falha no download do servidor do lado do cliente"],"src/configuration-file-picker":["Ajuda","sobre arquivos de configuração SSH","Definições","especificar um arquivo de configuração personalizado","Editar arquivo de configuração SSH personalizado","Selecione o arquivo de configuração SSH a ser atualizado"],"src/extension":["Configurando o Host SSH {0}","Falha ao estabelecer conexão com \"{0}\": {1}","Falha ao estabelecer conexão com \"{0}\""],"src/help":["Repetir","Fechar Remoto","Mais Ações...","Escolha uma ação para ajudar a resolver o problema.","Abrir Recentes...","Abrir Documentação","Abrir Arquivo de Configuração SSH","Abrir as Configurações"],"src/host-picker":["Configurar Hosts SSH...","{0} Adicionar Novo Host SSH...","Selecione o host SSH configurado ou digite user@host"],"src/local-install":["Falha ao baixar o Servidor do VS Code localmente","Baixando o Servidor do VS Code localmente","Copiando o Servidor do VS Code para hospedar com scp"],"src/local-server-resolver":["Aguardando a conexão de outras janelas","Host do Windows detectado, precisa se reconectar"],"src/resolver":["Inicializando VS Code Server","Conectar-se ao Servidor do VS Code - tente novamente {0}"],"src/ssh-command-generator":["Não Mostrar Isto Novamente","Falha ao localizar um SSH não Windows instalado. Os prompts de senha podem não ser exibidos corretamente! Desabilitar `remote.SSH.useLocalServer`, se necessário.","Saiba Mais","Não foi possível encontrar uma instalação SSH"],"src/ssh-command-runner":["Inserir a frase secreta para a chave ssh {0}","Inserir a senha para ${0}","Inserir senha","\"{0}\" tem impressão digital \"{1}\".","Tem certeza de que deseja continuar?","Tem certeza de que deseja continuar a se conectar?","Continuar","Cancelar"],"src/ssh-hosts":["Arquivo de configuração para salvar","Abrir Configuração","Conectar","Anfitrião adicionado!","Inserir Comando de Conexão SSH","O nome do host SSH não pode começar com {0}","O nome de usuário SSH não pode começar com {0}","O nome do host SSH não pode incluir o caractere {0}","O nome de usuário SSH não pode incluir o caractere {0}"],"src/ssh-tunnels":["Falha ao localizar uma porta local livre: {0}","Aguardando o encaminhamento de porta estar pronto","Erro ao estabelecer túnel ({0}).","Mostrar detalhes no terminal","Configurando o túnel SSH","Tempo máximo de espera esgotado","Configurando o túnel SSH"],"src/terminal-resolver":["O host remoto pode não atender aos pré-requisitos do Servidor do VS Code para glibc e libstdc++","Mais Informações"],"src/install-script/install-result":["Falha ao baixar o Servidor do VS Code. Tente novamente mais tarde.","Falha no download do Servidor do VS Code - instale curl ou wget no controle remoto.","Falha na verificação do status do Servidor do VS Code - instale curl ou wget no controle remoto.","Não há suporte para a arquitetura do host remoto","Não há suporte para a plataforma do host remoto","A arquitetura do host remoto é compatível apenas com VS Code Insiders","Os hosts do Windows são compatíveis apenas com VS Code Insiders","O Servidor do VS Code falhou ao iniciar","O Servidor do VS Code foi encerrado devido à presença de CVE-2020-1416. Verifique o canal de saída Remote-SSH para obter mais detalhes.","Falha ao criar o diretório de instalação do servidor remoto","Falha ao instalar o Servidor do VS Code","A rede está inacessível","Não foi possível resolver o nome do host","O processo tentou gravar em um pipe inexistente","O tempo limite da conexão foi atingido","A operação atingiu o tempo limite","Sem rota para hospedar","Não é possível atribuir o endereço solicitado","A chave do host remoto foi alterada, o encaminhamento de porta está desabilitado","bash não encontrado","A conexão foi cancelada"],"src/utils/progress":["Baixando Servidor do VS Code","Instalando o Servidor do VS Code"]}