{"src/client/application/diagnostics/checks/macPythonInterpreter":["L’installation système macOS sélectionnée de Python n’est pas recommandée, certaines fonctionnalités de l’extension seront limitées. [Install another version of Python](https://www.python.org/downloads) ou sélectionnez un autre interpréteur pour une expérience optimale. [Learn more](https://aka.ms/AA7jfor)."],"src/client/application/diagnostics/checks/powerShellActivation":["L’activation de l’environnement Python sélectionné n’est pas prise en charge dans PowerShell. Changez votre interpréteur de commandes en Invite de commandes."],"src/client/application/diagnostics/checks/pythonInterpreter":["Aucun interpréteur Python n’est sélectionné. Sélectionnez un interpréteur Python pour activer des fonctionnalités telles qu’IntelliSense, le linting et le débogage.","Un interpréteur Python non valide est sélectionné{0}, essayez de le modifier pour activer des fonctionnalités telles que IntelliSense, le linting et le débogage.","pour l’espace de travail"],"src/client/browser/localize":["État d’IntelliSense Python","Mode partiel","IntelliSense limité fourni par Pylance","En savoir plus"],"src/client/common/experiments/service":["L’expérience «{0}» est inactive","L’expérience «{0}» est active","L’expérience «{0}» est inactive","L’expérience «{0}» est active","L’expérience «{0}» est active"],"src/client/common/installer/moduleInstaller":["Installation en cours de {0}"],"src/client/common/installer/productInstaller":["Utiliser {0}","Le formateur {0}n’est pas installé. Installer?","Le chemin d’accès au formateur {0} n’est pas valide ({1})","Linter {0} n’est pas installé.","Le chemin d’accès au linter {0} n’est pas valide ({1})","Le framework de test {0} n’est pas installé. Installer ?","Le chemin d’accès au framework de test {0} n’est pas valide ({1})","Impossible d’installer {0}. Si pip n’est pas disponible, utilisez le gestionnaire de package de votre choix pour installer manuellement cette bibliothèque dans votre environnement Python.","La bibliothèque de science des données {0} n’est pas installée. Installer?"],"src/client/common/net/fileDownloader":["Téléchargement de {0}...","{0}{1} de {2} Ko ({3}%)"],"src/client/common/utils/localize":["La prise en charge du mappage de source est activée dans l’extension Python, ce qui a un impact négatif sur les performances de l’extension.","Désactiver la prise en charge du mappage de source","L’activation de la prise en charge du mappage de source dans l’extension Python a un impact négatif sur les performances de l’extension.","Activez et rechargez la fenêtre.","Votre système d’exploitation ne répond pas à la configuration minimale requise du serveur de langage Python. Rétablissement du fournisseur d’autocomplétion alternatif, Jedi.","Le paramètre « python.pythonPath » dans votre fichier settings.json n’est plus utilisé par l’extension Python. Si vous le souhaitez, vous pouvez utiliser un nouveau paramètre appelé « python.defaultInterpreterPath » à la place. N’oubliez pas que vous devez modifier manuellement la valeur de ce paramètre, car l’extension Python ne la modifie pas lorsque vous modifiez des interpréteurs. [En savoir plus](https://aka.ms/AA7jfor).","Vous devez sélectionner un interpréteur Python avant de commencer le débogage. \r\n\r\nConseil : cliquez sur « Sélectionner un Interpréteur » dans la barre d’état.","Le chemin Python de votre configuration de débogage n’est pas valide.","Votre fichier launch.json doit être mis à jour pour modifier les configurations de débogage « pythonExperimental » afin d’utiliser le type de débogueur « python », sinon le débogage Python risque de ne pas fonctionner. Voulez-vous mettre à jour automatiquement votre fichier launch.json maintenant ?","Votre fichier launch.json doit être mis à jour pour changer la chaîne de type de console de « none » en « internalConsole », sinon le débogage Python risque de ne pas fonctionner. Voulez-vous mettre automatiquement à jour votre fichier launch.json maintenant ?","La configuration « debugStdLib » dans launch.json n’est plus prise en charge. Il est recommandé de le remplacer par « justMyCode », qui est exactement le contraire de l’utilisation de « debugStdLib ». Voulez-vous mettre à jour automatiquement votre fichier launch.json pour ce faire ?","Oui, mettre à jour launch.json","Vos paramètres doivent être mis à jour pour remplacer le paramètre « python.unitTest » par « python.testing ». Sinon, le test du code Python à l’aide de l’extension risque de ne pas fonctionner. Voulez-vous mettre automatiquement à jour vos paramètres maintenant ?","Oui, mettre à jour les paramètres","Nous avons détecté une configuration obsolète pour le tri des importations dans cet espace de travail. Vérifiez le [isort upgrade guide](https://aka.ms/AA9j5x4) pour mettre à jour vos paramètres.","L’extension Python inclut désormais Pylance pour améliorer les complétions, la navigation dans le code, les performances globales et bien plus encore ! Vous pouvez en savoir plus sur la mise à jour et découvrir comment modifier votre serveur de langue [here](https://aka.ms/new-python-bundle).\r\n\r\nLire la licence de Pylance [here](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license).","Oui","Non","Oui, je souhaite être notifié","Annulé","Annuler","OK","Erreur","OK !","Installer","Chargement de l’extension Python...","Afficher la sortie","Non, je le fais plus tard","Pas maintenant","Ne plus afficher","Recharger","Informations supplémentaires","En savoir plus","et","Oui, je souhaite être notifié","Recommandé","Effacer tout","Toujours ignorer","Ignorer","Sélectionner l’interpréteur Python","Ouvrir launch.json","Utiliser Command Prompt","Télécharger","Me rappeler plus tard","Oui, participer à l’enquête maintenant","Non, merci","Attacher au processus","Sélectionner le processus à attacher","Aucun processus sélectionné","Actualiser la liste des processus","Me rappeler plus tard","L’extension Pylance n’est pas installée.","L’extension Pylance est maintenant installée. Recharger la fenêtre pour l’activer ?","L’extension Pylance n’est pas installée, mais la valeur python.languageServer est définie sur « Pylance ». Voulez-vous installer l’extension Pylance pour utiliser Pylance ou revenir à Studio ?","Installer Pylance","Revenir au Jedi","Entrer l’URL distante","Entrez une URL pointant vers un répertoire distant contenant vos fichiers journaux TensorBoard","TensorBoard recherche les fichiers tfevent dans tous les sous-répertoires du répertoire de travail actuel","Utiliser le répertoire de travail actif","Sélectionnez un répertoire de journal pour démarrer TensorBoard avec","Démarrage de la session TensorBoard...","VS Code prend désormais en charge TensorBoard intégré. Voulez-vous lancer TensorBoard ?  (Conseil : lancez TensorBoard à tout moment en ouvrant la palette de commandes et en recherchant « Launch TensorBoard »).","Sélectionner un dossier","Sélectionner un répertoire de journal contenant les fichiers tfevent","Déboguer l'application Django","Utiliser l’Explorateur de fichiers pour sélectionner un autre dossier","Le tensorBoard du package est nécessaire pour lancer une session TensorBoard. Voulez-vous l’installer ?","TensorBoard >= 2.4.1 et le plug-in TensorBoard PyTorch Profiler >= 0.2.0 sont obligatoires. Voulez-vous installer ces packages ?","Nous vous recommandons d’installer la version >= 0.2.0 du plug-in TensorBoard PyTorch Profiler. Voulez-vous installer le package ?","La prise en charge de TensorBoard intégré est uniquement disponible pour TensorBoard >= 2.4.1. Voulez-vous mettre à niveau votre copie de TensorBoard ?","▶ Lancer la session TensorBoard","Lancer la session TensorBoard","Nous n’avons pas pu localiser le fichier source demandé sur le disque. Spécifiez manuellement le fichier.","Choisir un fichier","Le contenu du fichier source ne correspond peut-être pas au contenu d’origine dans la trace.","IntelliSense limité pris en charge par Jedi et Pylance","État d’IntelliSense Python","Mode partiel","IntelliSense limité fourni par Pylance","Démarrage du serveur de langage Pylance","La prise en charge de l’éditeur est inactive, car le serveur de langage est défini sur Aucun.","Seul Pylance est pris en charge dans les espaces de travail non approuvés, en définissant le serveur de langage sur Aucun.","Rechargez la fenêtre en basculant entre les serveurs de langue.","Nous avons rencontré un problème lors du démarrage du serveur de langue. Retour au moteur du langage Jedi. Pour plus d’informations, consultez le panneau de sortie Python.","Nous avons rencontré un problème lors du téléchargement du serveur de langue. Rétablissement du moteur de langage de l’Assistant. Pour plus d’informations, consultez le panneau de sortie Python.","Nous avons rencontré un problème lors de l’extraction du serveur de langue. Retour au moteur du langage Jedi. Pour plus d’informations, consultez le panneau de sortie Python.","Échec du téléchargement du serveur de langue.","Échec de l’extraction du serveur de langage.","Téléchargement du serveur de langage terminé.","terminé.","Les chemins de recherche ont été modifiés pour cet interpréteur Python. Rechargez l’extension pour vous assurer qu’IntelliSense fonctionne correctement.","Installation de Python dans l’environnement...","Découverte des interpréteurs Python","Actualisation des interpréteurs Python","Nous avons remarqué que vous utilisez un environnement conda. Si vous rencontrez des problèmes avec cet environnement dans le terminal intégré, nous vous recommandons de laisser l’extension Python remplacer \"terminal.integrated.inheritEnv\" par false dans vos paramètres utilisateur.","Nous avons remarqué qu’un environnement virtuel a été créé. Voulez-vous le sélectionner pour le dossier de l’espace de travail ?","Sélectionner au niveau de l’espace de travail","Effacer au niveau de l’espace de travail","Conseil : vous pouvez modifier l’interpréteur Python utilisé par l’extension Python en cliquant sur la version Python dans la barre d’état","💡 Essayez d’installer le package Python à l’aide de votre gestionnaire de package. Vous pouvez également le télécharger à partir de https://www.python.org/downloads","Python n’est pas installé, téléchargez-le et installez-le.","Cliquez pour obtenir des instructions...","Mondial","Espace de travail","Entrer le chemin de l’interpréteur...","Entrez le chemin d’un interpréteur Python.","Utiliser Python à partir du paramètre « python.defaultInterpreterPath »","Rechercher...","Parcourez votre système de fichiers pour trouver un interpréteur Python.","Sélectionner un interpréteur","Sélectionner l’interpréteur Python","Actualiser la liste des interpréteurs","Effacer tout et actualiser la liste des interprètes","Actualisation de la liste des interprètes...","Serveur de langage Python","Python","Journal de test Python","Cwd:","Sélectionner Linter","Aucun programme d’installation de Conda ou Pip n’est disponible dans l’environnement sélectionné.","Aucun programme d’installation Pip n’est disponible dans l’environnement sélectionné.","Rechercher de l’aide","Pouvez-vous prendre 2 minutes pour nous indiquer comment l’extension Python fonctionne pour vous ?","Oui, participer à l’enquête maintenant","Non, merci","Peut-être plus tard","Sélectionnez une configuration de débogage","Configuration du débogage","Python","Sélectionner une configuration de débogage Python","Python : fichier actif","Fichier Python","Déboguer le fichier Python actuellement actif","Module Python","enter-your-module-name","Module","Déboguer un module Python en l’appelant avec '-m'","Déboguer le module","Entrer un nom de module/package Python","enter-your-module-name","Entrez un nom de module valide","Python : attachement distant","Attachement distant","Attacher à un serveur de débogage distant","Débogage distant","Entrer un nom d’hôte ou une adresse IP valide","Entrer un nom d’hôte ou une adresse IP valide","Débogage distant","Entrez le numéro de port sur lequel le serveur de débogage écoute","Entrez un numéro de port valide.","Python : attacher à l’aide de l’ID de processus","Attacher à l’aide de l’ID de processus","Attacher à un processus local","Python Django","Django","Lancer et déboguer une application web Django","Déboguer l'application Django","Entrez le chemin d’accès à manage.py ('${workspaceFolderToken}' pointe vers la racine du dossier d’espace de travail actuel)","Entrer un chemin d’accès de fichier Python valide","Python: FastAPI","FastAPI","Lancer et déboguer une application web FastAPI","Déboguer FastAPI","Entrez le chemin d’accès à l’application, par ex., « main.py » ou « main »","Entrez un nom valide.","Python Flask avec Redis","Flask","Lancer et déboguer une application web Flask","Déboguer Flask","Python Flask avec Redis","Entrez un nom valide.","Python : application Pyramid","Pyramide","Lancer et déboguer une application web Pyramid","Déboguer Pyramid","Entrez un chemin de fichier valide","Configurer l’infrastructure de tests","Aucune infrastructure de test configurée.","Annulation de la découverte des tests unitaires","Erreur de découverte de test Unittest","(voir Sortie > Python)","Annulation de l’exécution du test unittest","Erreur d’exécution de test Unittest","Nous avons remarqué que vous vous attachiez à ptvsd (débogueur Python), qui a été déprécié le 1er mai 2020. Basculez vers [debugpy](https://aka.ms/migrateToDebugpy).","IntelliSense avec Python pour Python 2.7 n’est plus pris en charge. [En savoir plus](https://aka.ms/python-27-support).","Le serveur de langage Microsoft Python a atteint la fin de vie. Votre serveur de langage a été défini sur la valeur par défaut pour Python dans VS Code, Pylance.\r\n\r\nSi vous souhaitez modifier votre serveur de langue, vous pouvez en savoir plus sur la procédure à suivre [here](https://devblogs.microsoft.com/python/python-in-visual-studio-code-may-2021-release/#configuring-your-language-server).\r\n\r\nLire la licence de Pylance [here](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license)."],"src/client/debugger/extension/banner":["Pouvez-vous prendre 2 minutes pour nous dire comment le débogueur fonctionne pour vous?"],"src/client/debugger/extension/adapter/factory":["Installez Python ou sélectionnez un interpréteur Python pour utiliser le débogueur."],"src/client/debugger/extension/attachQuickPick/provider":["Le système d’exploitation «{0}» n’est pas pris en charge."],"src/client/debugger/extension/configuration/providers/pyramidLaunch":["Entrez le chemin d’accès au fichier development.ini ({0} pointe vers la racine du dossier d’espace de travail actuel)"],"src/client/debugger/extension/hooks/childProcessAttachService":["Échec du lancement du débogueur pour le processus enfant {0}"],"src/client/formatters/blackFormatter":["Le noir ne prend pas en charge la commande « Format de sélection »."],"src/client/interpreter/configuration/pythonPathUpdaterService":["Échec de la définition du chemin de l’interpréteur. Erreur : {0}"],"src/client/interpreter/configuration/interpreterSelector/commands/setInterpreter":["Interpréteur sélectionné : {0}"],"src/client/interpreter/display/index":["Chemin de l’interpréteur Python : {0}","Chemin de l’interpréteur Python : {0}"],"src/client/languageServer/watcher":["Démarrage du serveur de langage Jedi pour {0}."],"src/client/linters/linterCommands":["Plusieurs linters sont activés dans les paramètres. Remplacer par «{0}» ?"],"src/client/linters/errorHandlers/standard":["Une erreur s’est produite lors de l’exécution du '{0}' linter"],"src/client/providers/importSortProvider":["Ouvrez un fichier Python pour trier les importations."],"src/client/tensorBoard/tensorBoardSession":["Actuel : {0}"],"src/client/tensorBoard/tensorBoardSessionProvider":["Nous n’avons pas pu démarrer une session TensorBoard en raison de l’erreur suivante : {0}"],"src/client/terminals/codeExecution/helper":["Aucun fichier ouvert à exécuter dans le terminal","Le fichier actif doit être enregistré avant de pouvoir être exécuté.","Le fichier actif n’est pas un fichier source Python)."],"src/client/testing/common/debugLauncher":["Impossible de charger la configuration de test unitaire à partir de launch.json, car il manque un champ."]}