{"src/client/application/diagnostics/checks/macPythonInterpreter":["A instalação do sistema macOS selecionado do Python não é recomendada, algumas funcionalidades na extensão serão limitadas. [Instale outra versão do Python](https://www.python.org/downloads) ou selecione um interpretador diferente para obter a melhor experiência. [Saiba mais](https://aka.ms/AA7jfor)."],"src/client/application/diagnostics/checks/powerShellActivation":["Não há suporte para a ativação do ambiente do Python selecionado no PowerShell. Considere alterar o shell para o Prompt de Comando."],"src/client/application/diagnostics/checks/pythonInterpreter":["Nenhum interpretador Python está selecionado. Selecione um interpretador Python para habilitar recursos como IntelliSense, lint e depuração.","Um interpretador Python inválido está selecionado{0}, tente alterá-lo para ativar recursos como IntelliSense, lint e depuração.","para espaço de trabalho"],"src/client/browser/localize":["Status do Python IntelliSense","Modo Parcial","IntelliSense limitado fornecido pela Pylance","Saiba mais"],"src/client/common/experiments/service":["O experimento '{0}' está inativo","O experimento '{0}' está ativo","O experimento '{0}' está inativo","O experimento '{0}' está ativo","O experimento '{0}' está ativo"],"src/client/common/installer/moduleInstaller":["Instalando {0}"],"src/client/common/installer/productInstaller":["Usar {0}","O formatador {0} não está instalado. Deseja instalar?","O caminho para o formatador {0} é inválido ({1})","O Linter {0} não está instalado.","O caminho para o {0} linter é inválido ({1})","A estrutura de testes {0} não está instalada. Instalar?","O caminho para a estrutura de testes {0} é inválido ({1})","Não foi possível instalar {0}. Se o pip não estiver disponível, use o gerenciador de pacotes de sua escolha para instalar manualmente essa biblioteca no seu ambiente Python.","A Biblioteca de Ciência de Dados {0} não está instalada. Deseja instalar?"],"src/client/common/net/fileDownloader":["Baixando {0}...","{0}{1} de {2} KB ({3}%)"],"src/client/common/utils/localize":["O suporte ao sourcemap está habilitado na Extensão do Python. Isso afetará negativamente o desempenho da extensão.","Desabilitar o Suporte ao SourceMap","Habilitar o suporte ao sourcemap na Extensão do Python afetará negativamente o desempenho da extensão.","Habilitar e recarregar a Janela.","Seu sistema operacional não atende aos requisitos mínimos do Servidor de Linguagem Python. Revertendo para o provedor de preenchimento automático alternativo, Jedi.","A configuração \"python.pythonPath\" no seu settings.json não é mais usada pela extensão do Python. Se desejar, você poderá usar uma nova configuração chamada \"python.defaultInterpreterPath\". Lembre-se de que você precisa alterar o valor dessa configuração manualmente, pois a extensão do Python não a modifica quando você altera os interpretadores. [Saiba mais](https://aka.ms/AA7jfor).","Você precisa selecionar um interpretador Python antes de iniciar a depuração.\r\n\r\nDica: clique em “Selecionar Interpretador” na barra de status.","O caminho do Python na sua configuração de depuração é inválido.","Seu arquivo launch.json precisa ser atualizado para alterar as configurações de depuração \"pythonExperimental\" para usar o tipo de depurador do \"python\", caso contrário, a depuração do Python pode não funcionar. Deseja atualizar automaticamente seu arquivo launch.json agora?","Seu arquivo launch.json precisa ser atualizado para alterar a cadeia de caracteres do tipo console de \"none\" para \"internalConsole\", caso contrário, a depuração do Python pode não funcionar. Deseja atualizar automaticamente seu arquivo launch.json agora?","A configuração \"debugStdLib\" em launch.json não é mais suportada. É recomendável substituí-la por \"justMyCode\", que é exatamente o oposto de usar \"debugStdLib\". Deseja atualizar automaticamente seu arquivo launch.json para fazer isso?","Sim, atualizar o launch.json","Suas configurações precisam ser atualizadas para alterar a configuração \"python.unitTest.\" para \"python.testing.\", caso contrário, testar um código Python usando a extensão pode não funcionar. Deseja atualizar automaticamente suas configurações agora?","Sim, atualizar as configurações","Encontramos uma configuração desatualizada para classificar importações neste espaço de trabalho. Verifique o [guia de atualização isort](https://aka.ms/AA9j5x4) para atualizar suas configurações.","A extensão do Python agora inclui o Pylance para melhorar as conclusões, a navegação por código, o desempenho geral e muito mais! Saiba mais sobre a atualização e saiba como alterar seu servidor de linguagem [aqui](https://aka.ms/new-python-bundle).\r\n\r\nLeia a licença do Pylance [aqui](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license).","Sim","Não","Sim, por favor","Cancelado","Cancelar","Ok","Erro","Entendido!","Instalar","Carregando a extensão do Python...","Mostrar saída","Não, farei isso mais tarde","Agora não","Não mostrar novamente","Recarregar","Mais informações","Saiba mais","e","Relatar esse problema","Recomendado","Limpar tudo","Sempre ignorar","Ignorar","Selecionar um Interpretador do Python","Abrir launch.json","Usar Prompt de Comando","Baixar","Lembrar mais tarde","Sim, participar da pesquisa agora","Não, obrigado.","Anexar ao processo","Selecione o processo ao qual anexar","Nenhum processo selecionado","Atualizar a lista de processos","Lembrar mais tarde","A extensão do Pylance não está instalada.","A extensão do Pylance agora está instalada. Recarregar a janela para ativar?","A extensão do Pylance não está instalada mas o valor python.languageServer está definido como \"Pylance\". Você gostaria de instalar a extensão do Pylance para usar o Pylance, ou reverter para Jedi?","Instalar o Pylance","Reverter para Jedi","Insira o URL remoto","Insira um URL apontando para um diretório remoto contendo seus arquivos de log do TensorBoard","O TensorBoard procurará arquivos tfevent em todos os subdiretórios do diretório de trabalho atual","Usar o diretório de trabalho atual","Selecione um diretório de log para iniciar o TensorBoard com","Iniciando a sessão do TensorBoard...","Agora o VS Code tem suporte integrado ao TensorBoard. Deseja iniciar o TensorBoard?  (Dica: Inicie o TensorBoard a qualquer momento abrindo a paleta de comandos e pesquisando por \"Iniciar TensorBoard\".)","Selecionar uma pasta","Selecione um diretório de log contendo arquivos tfevent","Selecione outra pasta","Usar o explorador de arquivos para selecionar outra pasta","O pacote TensorBoard é necessário para iniciar uma sessão do TensorBoard. Deseja instalá-lo?","O TensorBoard >= 2.4.1 e o plug-in PyTorch Profiler TensorBoard >= 0.2.0 são necessários. Deseja instalar estes pacotes?","Recomendamos a instalação da versão >= 0.2.0 do plug-in PyTorch Profiler TensorBoard. Deseja instalar o pacote?","O suporte integrado do TensorBoard está disponível apenas para o TensorBoard >= 2.4.1. Deseja atualizar sua cópia do TensorBoard?","▶ Iniciar a Sessão do TensorBoard","Iniciar a sessão do TensorBoard","Não foi possível localizar o arquivo de origem solicitado no disco. Especifique o arquivo manualmente.","Escolher Arquivo","O conteúdo do arquivo de origem pode não corresponder ao conteúdo original no rastreamento.","O IntelliSense limitado é suportado por Jedi e Pylance","Status do Python IntelliSense","Modo Parcial","IntelliSense limitado fornecido pela Pylance","Iniciando servidor de idiomas Pylance.","O suporte ao editor está inativo, já que o servidor de idiomas está configurado para Nenhum.","Somente o Pylance é suportado em espaços de trabalho não confiáveis, definindo o servidor de linguagem como Nenhum.","Recarregue a janela alternando entre os servidores de linguagem.","Encontramos um problema ao iniciar o servidor de linguagem. Revertendo para o mecanismo de linguagem Jedi. Verifique o painel de saída do Python para obter detalhes.","Encontramos um problema ao baixar o servidor de linguagem. Revertendo para o mecanismo de linguagem Jedi. Verifique o painel de saída do Python para obter detalhes.","Encontramos um problema ao extrair o servidor de linguagem. Revertendo para o mecanismo de linguagem Jedi. Verifique o painel de saída do Python para obter detalhes.","Falha no download do servidor de linguagem.","Falha na extração do servidor de linguagem.","Download do servidor de linguagem concluído.","concluído.","Os caminhos da pesquisa foram alterados para esse interpretador Python. Recarregue a extensão para garantir que o IntelliSense funcione corretamente.","Instalando o Python no ambiente...","Descobrindo Interpretadores Python","Atualizando os Interpretadores Python","Percebemos que você está usando um ambiente Conda. Se você estiver enfrentando problemas com este ambiente no terminal integrado, recomendamos que você permita que a extensão do Python altere “terminal.integrated.inheritenv” para false nas configurações do usuário.","Percebemos que um novo ambiente virtual foi criado. Deseja selecioná-lo para a pasta do espaço de trabalho?","Selecionar no nível do espaço de trabalho","Limpar no nível do espaço de trabalho","Dica: você pode alterar o interpretador Python usado pela extensão do Python clicando na versão Python na barra de status","💡 Tente instalar o pacote python usando o gerenciador de pacotes. Como alternativa, você também pode baixá-lo em https://www.python.org/downloads","Python não está instalado, faça o download e instale-o","Clique para instruções...","Global","Espaço de trabalho","Insira o caminho do interpretador...","Insira o caminho para um interpretador Python.","Usar o Python da configuração `python.defaultInterpreterPath`","Localizar...","Navegue pelo seu sistema de arquivos para encontrar um interpretador Python.","Selecionar Interpretador","Selecionar um Interpretador Python","Atualizar a lista de interpretadores","Limpar tudo e atualizar a lista de intérpretes","Atualizando lista de intérpretes...","Servidor de Linguagem Python","Python","Log de Teste do Python","cwd:","Selecionar Linter","Não há nenhum instalador Conda ou Pip disponível no ambiente selecionado.","Não há nenhum instalador Pip disponível no ambiente selecionado.","Pesquisar ajuda","Você pode reservar 2 minutos para nos dizer como a extensão do Python está funcionando para você?","Sim, participar da pesquisa agora","Não, obrigado.","Talvez mais tarde","Selecionar uma configuração de depuração","Configuração da Depuração","Python","Selecione uma configuração de depuração do Python","Python: Arquivo Atual","Arquivo Python","Depurar o arquivo Python ativo no momento","Python: Módulo","insira-o-nome-do-seu-módulo","Módulo","Depurar um módulo Python invocando-o com '-m'","Módulo de Depuração","Insira um nome para o módulo/pacote Python","insira-o-nome-do-seu-módulo","Insira um nome de módulo válido","Python: Anexação Remota","Anexação Remota","Anexar a um servidor de depuração remoto","Depuração Remota","Insira um nome de host válido ou endereço IP","Insira um nome de host válido ou endereço IP","Depuração Remota","Insira o número da porta que o servidor de depuração está escutando","Insira um número de porta válido.","Python: Anexar usando a ID do Processo","Anexar usando a ID do Processo","Anexar a um processo local","Python: Django","Django","Iniciar e depurar um aplicativo Web Django","Depurar Django","Insira o caminho para manage.py ('${workspaceFolderToken}'aponta para a raiz da pasta do espaço de trabalho atual)","Insira um caminho de arquivo Python válido","Python: FastAPI","FastAPI","Iniciar e depurar um aplicativo Web FastAPI","Depurar FastAPI","Insira o caminho para o aplicativo, por exemplo, 'main.py' ou 'main'","Insira um nome válido.","Python: Flask","Flask","Iniciar e depurar um aplicativo Web Flask","Depurar Flask","Python: Flask","Insira um nome válido.","Python: Aplicativo Pyramid","Pyramid","Iniciar e depurar um aplicativo Web Pyramid","Depurar Pyramid","Insira um caminho do arquivo válido.","Configurar o Framework de Testes","Nenhum framework de teste configurado.","A descoberta do teste unittest foi cancelada","Erro de descoberta do teste unittest","(consulte Saída > Python)","Execução do teste unittest cancelada","Erro de execução do teste unittest","Notamos que você está anexando ao ptvsd (depurador do Python), que foi preterido em 1º de maio de 2020. Mude para [debugpy](https://aka.ms/migrateToDebugpy).","O IntelliSense com Jedi para Python 2.7 não é mais suportado. [Saiba mais](https://aka.ms/python-27-support).","O Servidor de Linguagem Python da Microsoft atingiu o fim da vida útil. Seu servidor de linguagem foi definido como padrão para o Python no VS Code, Pylance.\r\n\r\nSe você quiser alterar seu servidor de linguagem, saiba como fazê-lo [aqui](https://devblogs.microsoft.com/python/python-in-visual-studio-code-may-2021-release/#configuring-your-language-server).\r\n\r\nLeia a licença do Pylance [aqui](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license)."],"src/client/debugger/extension/banner":["Você poderia reservar dois minutos para nos dizer como o depurador está funcionando para você?"],"src/client/debugger/extension/adapter/factory":["Instale o Python ou selecione um Interpretador do Python para usar o depurador."],"src/client/debugger/extension/attachQuickPick/provider":["O sistema operacional '{0}' não é suportado."],"src/client/debugger/extension/configuration/providers/pyramidLaunch":["Digite o caminho para development.ini ({0} aponta para a raiz da pasta do espaço de trabalho atual)"],"src/client/debugger/extension/hooks/childProcessAttachService":["Falha ao iniciar o depurador para o processo filho {0}"],"src/client/formatters/blackFormatter":["O Black não dá suporte ao comando \"Formatar Seleção\""],"src/client/interpreter/configuration/pythonPathUpdaterService":["Falha ao definir o caminho do interpretador. Erro: {0}"],"src/client/interpreter/configuration/interpreterSelector/commands/setInterpreter":["Interpretador Selecionado: {0}"],"src/client/interpreter/display/index":["Caminho do interpretador Python: {0}","Caminho do interpretador Python: {0}"],"src/client/languageServer/watcher":["Iniciando o servidor de linguagem Jedi para {0}."],"src/client/linters/linterCommands":["Vários linters estão habilitados nas configurações. Substituir por '{0}'?"],"src/client/linters/errorHandlers/standard":["Erro ao executar o linter '{0}'"],"src/client/providers/importSortProvider":["Abra um arquivo Python para classificar as importações."],"src/client/tensorBoard/tensorBoardSession":["Atual: {0}"],"src/client/tensorBoard/tensorBoardSessionProvider":["Não conseguimos iniciar uma sessão do TensorBoard devido ao seguinte erro: {0}"],"src/client/terminals/codeExecution/helper":["Nenhum arquivo aberto a ser executado no terminal","O arquivo ativo precisa ser salvo antes de ser executado","O arquivo ativo não é um arquivo de origem do Python)"],"src/client/testing/common/debugLauncher":["Não foi possível carregar a configuração de teste de unidade de launch.json porque está faltando um campo"]}