{"src/client/application/diagnostics/checks/macPythonInterpreter":["Die ausgewählte macOS-Systeminstallation von Python wird nicht empfohlen, da einige Funktionen in der Erweiterung eingeschränkt sind. [Installieren Sie eine andere Version von Python](https://www.python.org/downloads) oder wählen Sie für die beste Erfahrung einen anderen Interpreter aus. [Weitere Informationen](https://aka.ms/AA7jfor)."],"src/client/application/diagnostics/checks/powerShellActivation":["Die Aktivierung der ausgewählten Python-Umgebung wird in PowerShell nicht unterstützt. Erwägen Sie, die Shell auf die Eingabeaufforderung umzustellen."],"src/client/application/diagnostics/checks/pythonInterpreter":["Es ist kein Python-Interpreter ausgewählt. Bitte wählen Sie einen Python-Interpreter aus, um Features wie IntelliSense, Linten und Debuggen zu aktivieren.","Es wurde ein ungültiger Python-Interpreter ausgewählt{0}, bitte versuchen Sie ihn zu ändern, um Features wie IntelliSense, Linten und Debuggen zu aktivieren.","für Arbeitsbereich"],"src/client/browser/localize":["Python IntelliSense-Status","Teilmodus","Eingeschränktes IntelliSense, bereitgestellt von Pylance","Mehr erfahren"],"src/client/common/experiments/service":["Experiment '{0}' ist inaktiv","Experiment '{0}' ist aktiv","Experiment '{0}' ist inaktiv","Experiment '{0}' ist aktiv","Experiment '{0}' ist aktiv"],"src/client/common/installer/moduleInstaller":["Installieren {0}"],"src/client/common/installer/productInstaller":["Verwenden {0}","Formatierer {0} ist nicht installiert. Installieren?","Der Pfad zum {0} Formatierer ist ungültig ({1})","Linter {0} ist nicht installiert.","Der Pfad zum {0}-Linter ist ungültig ({1}).","Das Testframework {0} ist nicht installiert. Installieren?","Der Pfad zum {0}-Testframework ist ungültig ({1}).","Konnte nicht installiert werden {0}. Wenn pip nicht verfügbar ist, verwenden Sie bitte den Paketmanager Ihrer Wahl, um diese Bibliothek manuell in Ihrer Python-Umgebung zu installieren.","Die Data Science-Bibliothek {0} ist nicht installiert. Installieren?"],"src/client/common/net/fileDownloader":["Wird heruntergeladen {0}...","{0}{1} von {2} KB ({3}%)"],"src/client/common/utils/localize":["Die Quellzuordnungsunterstützung ist in der Python-Erweiterung aktiviert, dies wirkt sich negativ auf die Leistung der Erweiterung aus.","Deaktivieren Sie die Source Map-Unterstützung","Die Aktivierung der Quellzuordnungsunterstützung in der Python-Erweiterung wirkt sich negativ auf die Leistung der Erweiterung aus.","Windows aktivieren und neu laden.","Ihr Betriebssystem erfüllt nicht die Mindestanforderungen des Python Language Server. Zurück zum alternativen Autocompletion-Anbieter Jedi.","Die Einstellung „python.pythonPath“ in Ihrer settings.json wird nicht mehr von der Python-Erweiterung verwendet. Wenn Sie möchten, können Sie stattdessen eine neue Einstellung namens „python.defaultInterpreterPath“ verwenden. Denken Sie daran, dass Sie den Wert dieser Einstellung manuell ändern müssen, da die Python-Erweiterung ihn nicht ändert, wenn Sie Interpreter ändern. [Weitere Informationen](https://aka.ms/AA7jfor).","Sie müssen einen Python-Interpreter auswählen, bevor Sie mit dem Debuggen beginnen.\r\n\r\nTipp: Klicken Sie in der Statusleiste auf „Interpreter auswählen“.","Der Python-Pfad in Ihrer Debug-Konfiguration ist ungültig.","Ihre launch.json-Datei muss aktualisiert werden, um die „pythonExperimental“-Debugkonfigurationen so zu ändern, dass sie den „python“-Debuggertyp verwenden, andernfalls funktioniert das Python-Debugging möglicherweise nicht. Möchten Sie Ihre launch.json-Datei jetzt automatisch aktualisieren?","Ihre launch.json-Datei muss aktualisiert werden, um die Zeichenfolge des Konsolentyps von „none“ in „internalConsole“ zu ändern, andernfalls funktioniert das Python-Debugging möglicherweise nicht. Möchten Sie Ihre launch.json-Datei jetzt automatisch aktualisieren?","Die Konfiguration „debugStdLib“ in launch.json wird nicht mehr unterstützt. Es wird empfohlen, es durch \"justMyCode\" zu ersetzen, was das genaue Gegenteil von \"debugStdLib\" ist. Möchten Sie dafür Ihre launch.json-Datei automatisch aktualisieren?","Ja, launch.json aktualisieren","Ihre Einstellungen müssen aktualisiert werden, um die Einstellung „python.unitTest“ zu ändern. zu \"python.testing.\", andernfalls funktioniert das Testen von Python-Code mit der Erweiterung möglicherweise nicht. Möchten Sie Ihre Einstellungen jetzt automatisch aktualisieren?","Ja, Einstellungen aktualisieren","Wir haben eine veraltete Konfiguration zum Sortieren von Importen in diesem Arbeitsbereich gefunden. Überprüfen Sie die [Isort-Upgrade-Anleitung](https://aka.ms/AA9j5x4), um Ihre Einstellungen zu aktualisieren.","Die Python-Erweiterung enthält jetzt Pylance, um Vervollständigungen, Code-Navigation, Gesamtleistung und vieles mehr zu verbessern! Weitere Informationen zum Update und zum Ändern Ihres Sprachservers finden Sie [hier](https://aka.ms/new-python-bundle).\r\n\r\nLesen Sie die Lizenz von Pylance [hier](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license).","Ja","Nein","Ja, bitte","Abgebrochen","Abbrechen","Ok","Fehler","Verstanden!","Installieren","Python-Erweiterung wird geladen...","Ausgabe anzeigen","Nein, mache ich später","Jetzt nicht","Nicht mehr anzeigen","Neu laden","Mehr Info","Mehr erfahren","und","Melden Sie dieses Problem","Empfohlen","Alle löschen","Immer ignorieren","Ignorieren","Python-Interpreter auswählen","„launch.json“ öffnen","Eingabeaufforderung verwenden","Herunterladen","Erinnere mich später","Ja, nehmen Sie jetzt an der Umfrage teil","Nein, danke","An Prozess anhängen","Prozess auswählen, an den angefügt werden soll","Kein Prozess ausgewählt","Prozessliste aktualisieren","Erinnere mich später","Pylance-Erweiterung ist nicht installiert.","Die Pylance-Erweiterung ist jetzt installiert. Fenster zum Aktivieren neu laden?","Die Pylance-Erweiterung ist nicht installiert, aber der Wert von python.languageServer ist auf „Pylance“ gesetzt. Möchten Sie die Pylance-Erweiterung installieren, um Pylance zu verwenden, oder zu Jedi zurückkehren?","Pylance installieren","Zurück zu den Jedi","Remote-URL eingeben","Geben Sie eine URL ein, die auf ein Remoteverzeichnis verweist, das Ihre TensorBoard-Protokolldateien enthält","TensorBoard sucht in allen Unterverzeichnissen des aktuellen Arbeitsverzeichnisses nach tfevent-Dateien","Aktuelles Arbeitsverzeichnis verwenden","Wählen Sie ein Protokollverzeichnis aus, mit dem TensorBoard gestartet werden soll","TensorBoard-Sitzung wird gestartet...","VS Code verfügt jetzt über eine integrierte TensorBoard-Unterstützung. Möchten Sie TensorBoard starten? (Tipp: Starten Sie TensorBoard jederzeit, indem Sie die Befehlspalette öffnen und nach „Launch TensorBoard“ suchen.)","Ordner auswählen","Wählen Sie ein Protokollverzeichnis mit tfevent-Dateien aus","Wählen Sie einen anderen Ordner aus","Verwenden Sie den Datei-Explorer, um einen anderen Ordner auszuwählen","Das Paket TensorBoard wird benötigt, um eine TensorBoard-Sitzung zu starten. Möchten Sie es installieren?","TensorBoard >= 2.4.1 und das PyTorch Profiler TensorBoard-Plugin >= 0.2.0 sind erforderlich. Möchten Sie diese Pakete installieren?","Wir empfehlen die Installation von Version >= 0.2.0 des PyTorch Profiler TensorBoard-Plugins. Möchten Sie das Paket installieren?","Integrierte TensorBoard-Unterstützung ist nur für TensorBoard >= 2.4.1 verfügbar. Möchten Sie Ihre Kopie von TensorBoard aktualisieren?","▶ Starten Sie die TensorBoard-Sitzung","Starten Sie die TensorBoard-Sitzung","Wir konnten die angeforderte Quelldatei auf der Festplatte nicht finden. Bitte geben Sie die Datei manuell an.","Datei auswählen","Der Inhalt der Quelldatei stimmt möglicherweise nicht mit dem ursprünglichen Inhalt in der Ablaufverfolgung überein.","Begrenztes IntelliSense unterstützt von Jedi und Pylance","Python IntelliSense-Status","Teilmodus","Eingeschränktes IntelliSense, bereitgestellt von Pylance","Starten des Pylance-Sprachservers.","Die Editor-Unterstützung ist inaktiv, da der Sprachserver auf „Keine“ festgelegt ist.","Nur Pylance wird in nicht vertrauenswürdigen Arbeitsbereichen unterstützt, wobei der Sprachserver auf „Keine“ gesetzt wird.","Bitte laden Sie das Fenster zum Wechseln zwischen den Sprachservern neu.","Beim Starten des Sprachservers ist ein Problem aufgetreten. Rückkehr zur Jedi-Sprach-Engine. Einzelheiten finden Sie im Python-Ausgabebereich.","Beim Herunterladen des Sprachservers ist ein Problem aufgetreten. Rückkehr zur Jedi-Sprach-Engine. Einzelheiten finden Sie im Python-Ausgabebereich.","Beim Extrahieren des Sprachservers ist ein Problem aufgetreten. Rückkehr zur Jedi-Sprach-Engine. Einzelheiten finden Sie im Python-Ausgabebereich.","Download des Sprachservers fehlgeschlagen.","Sprachserver-Extraktion fehlgeschlagen.","Download des Sprachservers abgeschlossen.","fertig.","Suchpfade haben sich für diesen Python-Interpreter geändert. Bitte laden Sie die Erweiterung neu, um sicherzustellen, dass IntelliSense ordnungsgemäß funktioniert.","Python in Umgebung installieren...","Entdeckung von Python-Interpretern","Aktualisieren von Python-Interpretern","Wir haben festgestellt, dass Sie eine Conda-Umgebung verwenden. Wenn Sie Probleme mit dieser Umgebung im integrierten Terminal haben, empfehlen wir, dass Sie die Python-Erweiterung „terminal.integrated.inheritEnv“ in Ihren Benutzereinstellungen auf „false“ ändern lassen.","Wir haben festgestellt, dass eine neue virtuelle Umgebung erstellt wurde. Möchten Sie es für den Arbeitsbereichsordner auswählen?","Auf Arbeitsbereichsebene auswählen","Auf Arbeitsbereichsebene löschen","Tipp: Sie können den von der Python-Erweiterung verwendeten Python-Interpreter ändern, indem Sie in der Statusleiste auf die Python-Version klicken","💡 Versuchen Sie, das Python-Paket mithilfe Ihres Paket-Managers zu installieren. Alternativ können Sie es auch von https://www.python.org/downloads herunterladen.","Python ist nicht installiert, bitte laden Sie es herunter und installieren Sie es","Klicken Sie, um Anweisungen zu finden...","Global","Arbeitsplatz","Interpreterpfad eingeben...","Geben Sie den Pfad zu einem Python-Interpreter ein.","Verwenden Sie Python aus der Einstellung „python.defaultInterpreterPath“.","Suchen...","Durchsuchen Sie Ihr Dateisystem nach einem Python-Interpreter.","Dolmetscher auswählen","Wählen Sie den Python-Interpreter aus","Dolmetscherliste aktualisieren","Alle löschen und Interpreterliste aktualisieren","Interpreterliste wird aktualisiert...","Python-Sprachserver","Python","Python-Testprotokoll","сwd:","Linter auswählen","In der ausgewählten Umgebung ist kein Conda- oder Pip-Installationsprogramm verfügbar.","In der ausgewählten Umgebung ist kein Pip-Installationsprogramm verfügbar.","Suche nach Hilfe","Können Sie sich bitte 2 Minuten Zeit nehmen, um uns mitzuteilen, wie die Python-Erweiterung für Sie funktioniert?","Ja, nehmen Sie jetzt an der Umfrage teil","Nein, danke","Vielleicht später","Debugkonfiguration auswählen","Debug-Konfiguration","Python","Wählen Sie eine Python-Debugkonfiguration aus","Python: Aktuelle Datei","Python-Datei","Debuggen Sie die derzeit aktive Python-Datei","Python-Modul","Geben Sie Ihren Modulnamen ein","Modul","Debuggen Sie ein Python-Modul, indem Sie es mit „-m“ aufrufen.","Debug-Modul","Geben Sie einen Python-Modul-/Paketnamen ein","Geben Sie Ihren Modulnamen ein","Geben Sie einen gültigen Modulnamen ein","Python: Remote-Attach","Remote-Attach","An einen Remote-Debug-Server anhängen","Remotedebugging","Geben Sie einen gültigen Hostnamen oder eine gültige IP-Adresse ein.","Geben Sie einen gültigen Hostnamen oder eine gültige IP-Adresse ein.","Remotedebugging","Geben Sie die Portnummer ein, die der Debug-Server überwacht","Geben Sie eine gültige Portnummer ein","Python: Anhängen mit Prozess-ID","Mit Prozess-ID anhängen","An einen lokalen Prozess anhängen","Python: Django","Django","Starten und debuggen Sie eine Django-Webanwendung","Debuggen Sie Django","Geben Sie den Pfad zu manage.py ein ('${workspaceFolderToken}' zeigt auf das Stammverzeichnis des aktuellen Workspace-Ordners)","Geben Sie einen gültigen Python-Dateipfad ein","Python: FastAPI","FastAPI","Starten und debuggen Sie eine FastAPI-Webanwendung","Debuggen Sie FastAPI","Geben Sie den Pfad zur Anwendung ein, z. 'main.py' oder 'main'","Geben Sie einen gültigen Namen ein","Python: Flask","Flask","Starten und debuggen Sie eine Flask-Webanwendung","Flask debuggen","Python: Flask","Geben Sie einen gültigen Namen ein","Python: Pyramidenanwendung","Pyramide","Starten und debuggen Sie eine Pyramid-Webanwendung","Pyramide debuggen","Geben Sie einen gültigen Dateipfad ein","Testframework konfigurieren","Kein Testframework konfiguriert.","Abgebrochene Einheitentest-Testerkennung","Unittest-Testerkennungsfehler","(siehe Ausgabe > Python)","Komponententestausführung abgebrochen","Fehler bei Komponententestausführung","Wir haben festgestellt, dass Sie ptvsd (Python-Debugger) anhängen, das am 1. Mai 2020 veraltet ist. Bitte wechseln Sie zu [debugpy](https://aka.ms/migrateToDebugpy).","IntelliSense mit Jedi für Python 2.7 wird nicht mehr unterstützt. [Weitere Informationen](https://aka.ms/python-27-support).","Der Microsoft Python Language Server hat das Ende seiner Lebensdauer erreicht. Ihr Sprachserver wurde auf den Standardwert für Python in VS Code, Pylance festgelegt.\r\n\r\nWenn Sie Ihren Sprachserver ändern möchten, erfahren Sie [hier](https://devblogs.microsoft.com/python/python-in-visual-studio-code-may-2021-release /#Konfigurieren-Ihres-Sprachservers).\r\n\r\nLesen Sie die Lizenz von Pylance [hier](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license)."],"src/client/debugger/extension/banner":["Können Sie sich bitte 2 Minuten Zeit nehmen, um uns mitzuteilen, wie der Debugger für Sie funktioniert?"],"src/client/debugger/extension/adapter/factory":["Installieren Sie Python, oder wählen Sie einen Python-Interpreter aus, um den Debugger zu verwenden."],"src/client/debugger/extension/attachQuickPick/provider":["Betriebssystem '{0}' wird nicht unterstützt."],"src/client/debugger/extension/configuration/providers/pyramidLaunch":["Geben Sie den Pfad zu development.ini ein ({0} zeigt auf das Stammverzeichnis des aktuellen Arbeitsbereichsordners)"],"src/client/debugger/extension/hooks/childProcessAttachService":["Fehler beim Starten des Debuggers für den untergeordneten Prozess {0}"],"src/client/formatters/blackFormatter":["Black unterstützt den Befehl „Auswahl formatieren“ nicht."],"src/client/interpreter/configuration/pythonPathUpdaterService":["Fehler beim Festlegen des Interpreterpfads. Fehler: {0}"],"src/client/interpreter/configuration/interpreterSelector/commands/setInterpreter":["Ausgewählter Interpreter: {0}"],"src/client/interpreter/display/index":["Pfad zum Python-Interpreter: {0}","Pfad zum Python-Interpreter: {0}"],"src/client/languageServer/watcher":["Starten des Jedi-Sprachservers für {0}."],"src/client/linters/linterCommands":["In den Einstellungen sind mehrere Linters aktiviert. Ersetzen mit '{0}'?"],"src/client/linters/errorHandlers/standard":["Fehler beim Ausführen des Linters „{0}“."],"src/client/providers/importSortProvider":["Öffnen Sie eine Python-Datei, um die Importe zu sortieren."],"src/client/tensorBoard/tensorBoardSession":["Aktuell: {0}"],"src/client/tensorBoard/tensorBoardSessionProvider":["Aufgrund des folgenden Fehlers konnten wir keine TensorBoard-Sitzung starten: {0}"],"src/client/terminals/codeExecution/helper":["Keine geöffnete Datei zum Ausführen im Terminal","Die aktive Datei muss gespeichert werden, bevor sie ausgeführt werden kann.","Die aktive Datei ist keine Python-Quelldatei."],"src/client/testing/common/debugLauncher":["Die Komponententestkonfiguration konnte nicht aus „launch.json“ geladen werden, weil ein Feld fehlt."]}