{"src/client/application/diagnostics/checks/macPythonInterpreter":["No se recomienda la instalación de Python en el sistema macOS seleccionado, ya que algunas funcionalidades de la extensión estarán limitadas. [Instale otra versión de Python](https://www.python.org/downloads) o seleccione un intérprete diferente para obtener la mejor experiencia. [Más información](https://aka.ms/AA7jfor)."],"src/client/application/diagnostics/checks/powerShellActivation":["PowerShell no admite la activación del entorno de Python seleccionado. Considere la posibilidad de cambiar el shell al símbolo del sistema."],"src/client/application/diagnostics/checks/pythonInterpreter":["No se ha seleccionado ningún intérprete de Python. Seleccione un intérprete de Python para habilitar características como IntelliSense, linting y depuración.","Se ha seleccionado un intérprete de Python no válido{0}, intente cambiarlo para habilitar las características como IntelliSense, linting y depuración.","para el área de trabajo"],"src/client/browser/localize":["Estado de IntelliSense de Python","Modo parcial","IntelliSense limitado proporcionado por Pylance","Más información"],"src/client/common/experiments/service":["El experimento \\\"{0}\\\" está inactivo","El experimento \\\"{0}\\\" está activo","El experimento \\\"{0}\\\" está inactivo","El experimento \\\"{0}\\\" está activo","El experimento \\\"{0}\\\" está activo"],"src/client/common/installer/moduleInstaller":["Instalando {0}"],"src/client/common/installer/productInstaller":["Usar {0}","El formateador {0} no está instalado. ¿Desea instalarlo?","La ruta de acceso al formateador {0} no es válida ({1})","Linter {0} no está instalado.","La ruta de acceso al linter {0} no es válida ({1})","El marco de pruebas {0} no está instalado. ¿Quiere instalarlo?","La ruta de acceso al marco de pruebas de {0} no es válida ({1})","No se pudo instalar {0}. Si pip no está disponible, use el administrador de paquetes que prefiera para instalar manualmente esta biblioteca en el entorno de Python.","La biblioteca de ciencia de datos {0} no está instalada. ¿Desea instalarla?"],"src/client/common/net/fileDownloader":["Descargando {0}...","{0}{1} de {2} KB ({3} %)"],"src/client/common/utils/localize":["La compatibilidad con el mapa de origen está habilitada en la extensión de Python, lo que afectará negativamente al rendimiento de la extensión.","Deshabilitar la compatibilidad con mapas de origen","Habilitar la compatibilidad con el mapa de origen en la extensión de Python afectará negativamente al rendimiento de la extensión.","Habilite y vuelva a cargar la ventana.","El sistema operativo no cumple los requisitos mínimos del servidor de lenguaje Python. Revirtiendo al proveedor de autocompletar alternativo, Jedi.","La extensión de Python ya no usa la configuración \"python.pythonPath\" en settings.json. Si lo desea, puede usar en su lugar una nueva configuración denominada \"python.defaultInterpreterPath\". Tenga en cuenta que debe cambiar el valor de esta configuración manualmente, ya que la extensión de Python no la modifica al cambiar los intérpretes. [Más información](https://aka.ms/AA7jfor).","Debe seleccionar un intérprete de Python antes de iniciar la depuración.\r\n\r\nSugerencia: haga clic en \"Seleccionar intérprete\" en la barra de estado.","La ruta de acceso de Python de la configuración de depuración no es válida.","El archivo launch.json debe actualizarse para cambiar las configuraciones de depuración \"pythonExperimental\" para usar el tipo de depurador \"python\". De lo contrario, es posible que la depuración de Python no funcione. ¿Desea actualizar automáticamente el archivo launch.json ahora?","El archivo launch.json debe actualizarse para cambiar la cadena de tipo de consola de \"none\". a \"internalConsole\"; de lo contrario, es posible que la depuración de Python no funcione. ¿Desea actualizar automáticamente el archivo launch.json ahora?","Ya no se admite la configuración \"debugStdLib\" en launch.json. Se recomienda reemplazarlo por \"justMyCode\", que es exactamente lo contrario de usar \"debugStdLib\". ¿Desea actualizar automáticamente el archivo launch.json para hacer esto?","Sí, actualizar launch.json","La configuración debe actualizarse para cambiar la configuración \"python.unitTest.\" a \"python.testing.\"; de lo contrario, es posible que la prueba del código Python con la extensión no funcione. ¿Desea actualizar automáticamente la configuración ahora?","Sí, actualizar la configuración","Encontramos una configuración obsoleta para ordenar las importaciones en esta área de trabajo. Consulte la [guía de actualización de isort](https://aka.ms/AA9j5x4) para actualizar la configuración.","La extensión de Python ahora incluye Pylance para mejorar las finalizaciones, la navegación por el código, el rendimiento general y mucho más. Puede obtener más información sobre la actualización y aprender a cambiar el servidor de lenguaje [aquí](https://aka.ms/new-python-bundle).\r\n\r\nLea la licencia de Pylance [aquí](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license).","Sí","No","Sí, por favor","Cancelado","Cancelar","Aceptar","Error","¡Entendido!","Instalar","Cargando extensión de Python...","Mostrar salida","No, lo haré más tarde","Ahora no","No volver a mostrar","Recargar","Más información","Más información","y","Informar sobre este problema","Recomendaciones","Borrar todo","Ignorar siempre","Ignorar","Seleccionar un intérprete de Python","Abrir launch.json","Usar símbolo del sistema","Descargar","Recordármelo más tarde","Sí, realizar una encuesta ahora","No, gracias","Asociar al proceso","Seleccione el proceso al que debe asociarse","No se ha seleccionado ningún proceso","Actualizar la lista de procesos","Recordármelo más tarde","La extensión de Pylance no está instalada.","La extensión de Pylance ya está instalada. ¿Quieres volver a cargar la ventana para activarla?","La extensión de Pylance no está instalada, pero el valor python.languageServer se establece en \" Pylance\". ¿Desea instalar la extensión de Pylance para usar Pylance o revertir a Jedi?","Instalar Pylance","Revertir a Jedi","Escriba una dirección URL remota","Escriba una dirección URL que apunte a un directorio remoto que contenga los archivos de registro de TensorBoard","TensorBoard buscará archivos tfevent en todos los subdirectorios del directorio de trabajo actual","Usar el directorio de trabajo actual","Seleccione un directorio de registro con el que iniciar TensorBoard","Iniciando sesión de TensorBoard...","VS Code ahora tiene compatibilidad integrada con TensorBoard. ¿Desea iniciar TensorBoard?  (Sugerencia: Inicie TensorBoard en cualquier momento abriendo la paleta de comandos y buscando por \"Iniciar TensorBoard\").","Seleccionar una carpeta","Seleccionar un directorio de registro que contenga archivos tfevent","Seleccionar otra carpeta","Usar el explorador de archivos para seleccionar otra carpeta","El paquete TensorBoard es necesario para iniciar una sesión de TensorBoard. ¿Desea instalarlo?","Se requiere TensorBoard >= 2.4.1 y el complemento PyTorch Profiler TensorBoard >= 0.2.0. ¿Desea instalar estos paquetes?","Se recomienda instalar la versión >= 0.2.0 del complemento PyTorch Profiler TensorBoard. ¿Desea instalar el paquete?","La compatibilidad integrada de TensorBoard solo está disponible para TensorBoard >= 2.4.1. ¿Desea actualizar la copia de TensorBoard?","▶ Iniciar sesión de TensorBoard","Iniciar sesión de TensorBoard","No pudimos encontrar el archivo de origen solicitado en el disco. Especifique manualmente el archivo.","Elegir archivo","Es posible que el contenido del archivo de origen no coincida con el contenido original del seguimiento.","IntelliSense limitado compatible con Jedi y Pylance","Estado de IntelliSense de Python","Modo parcial","IntelliSense limitado proporcionado por Pylance","Iniciando el servidor de lenguaje Pylance.","La compatibilidad con el editor está inactiva porque el servidor de lenguaje está establecido en Ninguno.","Solo se admite Pylance en áreas de trabajo que no son de confianza, estableciendo el servidor de lenguaje en Ninguno.","Vuelva a cargar la ventana cambiando entre servidores de idioma.","Se ha detectado un problema al iniciar el servidor de lenguaje. Revirtiendo al motor del lenguaje Jedi. Consulte el panel de salida de Python para obtener más detalles.","Se ha detectado un problema al descargar el servidor de lenguaje. Revirtiendo al motor del lenguaje Jedi. Consulte el panel de salida de Python para obtener más detalles.","Se ha detectado un problema al extraer el servidor de lenguaje. Revirtiendo al motor del lenguaje Jedi. Consulte el panel de salida de Python para obtener más detalles.","Error al descargar el servidor de lenguaje.","Error en la extracción del servidor de lenguaje.","Se completó la descarga del servidor de lenguaje.","listo.","Las rutas de acceso de búsqueda han cambiado para este intérprete de Python. Vuelva a cargar la extensión para asegurarse de que IntelliSense funciona correctamente.","Instalando Python en el entorno...","Detección de intérpretes de Python","Actualización de intérpretes de Python","Hemos observado que usa un entorno de Conda. Si tiene problemas con este entorno en el terminal integrado, se recomienda dejar que la extensión de Python cambie \"terminal.integrated.inheritEnv\" a false en la configuración del usuario.","Hemos observado que se ha creado un nuevo entorno virtual. ¿Desea seleccionarlo para la carpeta del área de trabajo?","Seleccionar en el nivel de área de trabajo","Borrar en el nivel de área de trabajo","Sugerencia: Puede cambiar el intérprete de Python que usa la extensión de Python haciendo clic en la versión de Python en la barra de estado.","💡 Intente instalar el paquete de Python con el administrador de paquetes. También puede descargarlo desde https://www.python.org/downloads","Python no está instalado. Descárguelo e instálelo.","Haga clic para obtener instrucciones...","Global","Área de trabajo","Escriba la ruta de acceso del intérprete...","Escriba la ruta de acceso a un intérprete de Python.","Usar Python desde la configuración \\\"python.defaultInterpreterPath\\\"","Buscar...","Examine el sistema de archivos para buscar un intérprete de Python.","Seleccionar intérprete","Seleccionar un intérprete de Python","Actualizar lista de intérpretes","Borrar todo y actualizar lista de intérpretes","Actualizando lista de intérpretes...","Servidor de lenguaje Python","Python","Registro de pruebas de Python","cwd:","Seleccionar Linter","No hay ningún instalador de Conda o Pip disponible en el entorno seleccionado.","No hay ningún instalador Pip disponible en el entorno seleccionado.","Buscar ayuda","¿Puede dedicar 2 minutos a indicarnos cómo funciona la extensión de Python?","Sí, realizar una encuesta ahora","No, gracias","Quizás más tarde","Seleccione una configuración de depuración","Configuración de depuración","Python","Seleccione una configuración de depuración de Python","Python: archivo actual","Archivo de Python","Depurar el archivo de Python activo actualmente","Python: módulo","escriba-el-nombre-de-su-módulo","Módulo","Depuración de un módulo de Python invocándolo con \\\"-m\\\"","Módulo de depuración","Escriba un nombre de módulo o paquete de Python","escriba-el-nombre-de-su-módulo","Escriba un nombre de módulo válido","Python: conexión remota","Conexión remota","Asociar a un servidor de depuración remoto","Depuración remota","Escribir un nombre o dirección IP de host válidos","Escribir un nombre o dirección IP de host válidos","Depuración remota","Escriba el número de puerto en el que escucha el servidor de depuración.","Escriba un número de puerto válido.","Python: Adjuntar mediante un id. de proceso","Adjuntar mediante un id. de proceso","Asociar a un proceso emulador local","Python: Django","Django","Inicio y depuración de una aplicación web Django","Depurar Django","Escriba la ruta de acceso a manage.py (\\\"${workspaceFolderToken}\\\" apunta a la raíz de la carpeta del área de trabajo actual).","Escriba una ruta de acceso de archivo Python válida","Python: FastAPI","FastAPI","Iniciar y depurar una aplicación web FastAPI","Depurar FastAPI","Escriba la ruta de acceso a la aplicación; por ejemplo, \\\"main.py\\\" o \\\"main\\\".","Especifique un nombre válido","Python: Flask","Flask","Inicio y depuración de una aplicación web de Flask","Depurar Flask","Python: Flask","Especifique un nombre válido","Python: aplicación Pyramid","Pyramid","Inicio y depuración de una aplicación web Pyramid","Depurar Pyramid","Escriba una ruta de acceso de archivo válida","Configurar marco de pruebas","No hay ningún marco de pruebas configurado.","Detección de pruebas unitarias cancelada","Error de detección de pruebas unitarias","(consulte Salida > Python)","Se canceló la ejecución de pruebas unitarias","Error de ejecución de prueba unitaria","Hemos observado que está adjuntando a ptvsd (depurador de Python), que quedó en desuso el 1 de mayo de 2020. Cambie a [debugpy](https://aka.ms/migrateToDebugpy).","IntelliSense con Jedi para Python 2.7 ya no se admite. [Más información](https://aka.ms/python-27-support).","El servidor de lenguaje de Microsoft Python ha llegado al final de su vida útil. El servidor de lenguaje se ha establecido en el valor predeterminado para Python en VS Code, Pylance.\r\n\r\nSi quiere cambiar el servidor de idioma, puede obtener información sobre cómo hacerlo [aquí](https://devblogs.microsoft.com/python/python-in-visual-studio-code-may-2021-release/#configuring-your-language-server).\r\n\r\nLeer [aquí](https://marketplace.visualstudio.com/items/ms-python.vscode-pylance/license) la licencia de Pylance."],"src/client/debugger/extension/banner":["¿Puede tomarse 2 minutos para indicarnos cómo funciona el depurador?"],"src/client/debugger/extension/adapter/factory":["Instale Python o seleccione un intérprete de Python para usar el depurador."],"src/client/debugger/extension/attachQuickPick/provider":["No se admite el sistema operativo \\\"{0}\\\"."],"src/client/debugger/extension/configuration/providers/pyramidLaunch":["Escriba la ruta de acceso a development.ini ({0} apunta a la raíz de la carpeta del área de trabajo actual)"],"src/client/debugger/extension/hooks/childProcessAttachService":["No se pudo iniciar el depurador para el {0} de procesos secundarios"],"src/client/formatters/blackFormatter":["El negro no admite el comando \"Formato de selección\""],"src/client/interpreter/configuration/pythonPathUpdaterService":["No se pudo establecer la ruta de acceso del intérprete. Error: {0}"],"src/client/interpreter/configuration/interpreterSelector/commands/setInterpreter":["Intérprete seleccionado: {0}"],"src/client/interpreter/display/index":["Ruta de acceso del intérprete de Python: {0}","Ruta de acceso del intérprete de Python: {0}"],"src/client/languageServer/watcher":["Iniciando el servidor de lenguaje Jedi para {0}."],"src/client/linters/linterCommands":["Hay varios linters habilitados en la configuración. ¿Desea reemplazarlos por \\\"{0}\\\"?"],"src/client/linters/errorHandlers/standard":["Error al ejecutar el linter '{0}'"],"src/client/providers/importSortProvider":["Abra un archivo de Python para ordenar las importaciones."],"src/client/tensorBoard/tensorBoardSession":["Actual: {0}"],"src/client/tensorBoard/tensorBoardSessionProvider":["No se pudo iniciar una sesión de TensorBoard debido al siguiente error: {0}"],"src/client/terminals/codeExecution/helper":["No hay ningún archivo abierto para ejecutar en el terminal","Es necesario guardar el archivo activo para poder ejecutarlo","El archivo activo no es un archivo de origen de Python)"],"src/client/testing/common/debugLauncher":["No se pudo cargar la configuración de pruebas unitarias desde launch.json porque le falta un campo"]}